&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ФайлОбработки = Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	ТекущийКаталог = ФайлОбработки.Путь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестКомпоненты(Команда)

	МетоположениеКомпоненты = ТекущийКаталог + "\build\Debug\NativeAddIn.dll";
	ПодключитьВнешнююКомпоненту(МетоположениеКомпоненты, "TestAddin", ТипВнешнейКомпоненты.Native);
	ВнешняяКомпонента = Новый("AddIn.TestAddin.AddInNative");
	
	ВнешняяКомпонента.TEXT = "Свойство: ";
	Сообщить(ВнешняяКомпонента.ТексТ);
	
	ВнешняяКомпонента.УстановитьТЕКСТ("Функция: ");
	Сообщить(ВнешняяКомпонента.ПолучитьТЕКСТ());
	
	ВнешняяКомпонента.УстановитьТЕКСТ();
	Сообщить(ВнешняяКомпонента.ПолучитьТЕКСТ());
	
КонецПроцедуры

